aws/amazon-freertos/projects/microchip/same70_xult/mplab/aws_demos/firmware/src/config/same70_xult_nvm/driver/ethphy/src/dynamic/drv_ethphy.c
static void _DRV_PHY_NegCompleteSetOperResult(DRV_ETHPHY_CLIENT_OBJ * hClientObj, uint16_t phyBmConReg, uint16_t phyStatReg);

static const _DRV_PHY_OperPhaseF _DRV_PHY_NegCompletePhasesTbl[] = 
{
    _DRV_ETHPHY_NegCompletePhaseIdle,
    _DRV_ETHPHY_NegCompletePhaseRead1,
    _DRV_ETHPHY_NegCompletePhaseRead2,
    _DRV_ETHPHY_NegCompletePhaseResultNoWait,
    _DRV_ETHPHY_NegCompletePhaseAN_Restart,
    _DRV_ETHPHY_NegCompletePhaseAN_Complete,
};


static void _DRV_ETHPHY_NegResultPhaseIdle(DRV_ETHPHY_CLIENT_OBJ * hClientObj);
static void _DRV_ETHPHY_NegResultPhase_BMSTAT(DRV_ETHPHY_CLIENT_OBJ * hClientObj);
static void _DRV_ETHPHY_NegResultPhase_ANEXP(DRV_ETHPHY_CLIENT_OBJ * hClientObj);
static void _DRV_ETHPHY_NegResultPhase_ANLPAD(DRV_ETHPHY_CLIENT_OBJ * hClientObj);
static void _DRV_ETHPHY_NegResultPhase_ANAD(DRV_ETHPHY_CLIENT_OBJ * hClientObj);

static void _DRV_PHY_NegResultSetOperResult(DRV_ETHPHY_CLIENT_OBJ* hClientObj, DRV_ETHPHY_LINK_STATUS linkStatus,
                                    TCPIP_ETH_OPEN_FLAGS openFlags, TCPIP_ETH_PAUSE_TYPE pauseType, DRV_ETHPHY_RESULT res);

static const _DRV_PHY_OperPhaseF _DRV_PHY_NegResultPhasesTbl[] = 
{
    _DRV_ETHPHY_NegResultPhaseIdle,
    _DRV_ETHPHY_NegResultPhase_BMSTAT,
    _DRV_ETHPHY_NegResultPhase_ANEXP,
    _DRV_ETHPHY_NegResultPhase_ANLPAD,
    _DRV_ETHPHY_NegResultPhase_ANAD,
};

static void _DRV_ETHPHY_NegRestartPhaseIdle(DRV_ETHPHY_CLIENT_OBJ * hClientObj);
static void _DRV_ETHPHY_NegRestartPhaseRead(DRV_ETHPHY_CLIENT_OBJ * hClientObj);
static void _DRV_ETHPHY_NegRestartPhaseWrite(DRV_ETHPHY_CLIENT_OBJ * hClientObj);

static const _DRV_PHY_OperPhaseF _DRV_PHY_NegRestartPhasesTbl[] = 
{
    _DRV_ETHPHY_NegRestartPhaseIdle,
    _DRV_ETHPHY_NegRestartPhaseRead,
    _DRV_ETHPHY_NegRestartPhaseWrite,
};

static void _DRV_ETHPHY_ResetPhaseIdle(DRV_ETHPHY_CLIENT_OBJ * hClientObj);
static void _DRV_ETHPHY_ResetPhaseWrite(DRV_ETHPHY_CLIENT_OBJ * hClientObj);
static void _DRV_ETHPHY_ResetPhaseRead(DRV_ETHPHY_CLIENT_OBJ * hClientObj);

static const _DRV_PHY_OperPhaseF _DRV_PHY_ResetPhasesTbl[] = 
{
    _DRV_ETHPHY_ResetPhaseIdle,
    _DRV_ETHPHY_ResetPhaseWrite,
    _DRV_ETHPHY_ResetPhaseRead,
};

// local functions
//

static DRV_ETHPHY_LINK_STATUS _Phy2LinkStat(__BMSTATbits_t phyStat)
{
    DRV_ETHPHY_LINK_STATUS  linkStat;

    linkStat = (phyStat.LINK_STAT)?DRV_ETHPHY_LINK_ST_UP:DRV_ETHPHY_LINK_ST_DOWN;
    if(phyStat.REM_FAULT)
    {
        linkStat|=DRV_ETHPHY_LINK_ST_REMOTE_FAULT;
    }

    return linkStat;

}

#if (DRV_ETHPHY_USE_DRV_MIIM)
static DRV_ETHPHY_SMI_TXFER_OP_STATUS _DRV_PHY_SMITransferDo(DRV_ETHPHY_CLIENT_OBJ * hClientObj)
{
    DRV_MIIM_OPERATION_HANDLE miimOpHandle;
    DRV_MIIM_RESULT miimRes;
    DRV_ETHPHY_SMI_TXFER_OP_STATUS newTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_NONE;
    DRV_MIIM_OPERATION_FLAGS opFlags;
    uint16_t  opData;
    DRV_ETHPHY_SMI_XFER_TYPE txType = hClientObj->smiTxferType;

    switch(hClientObj->smiTxferStatus)
    {
        case DRV_ETHPHY_SMI_TXFER_OP_START:

            if(hClientObj->miimOpHandle != 0)
            {   // no operations queued, need to wait the end of the previous one
                return DRV_ETHPHY_SMI_TXFER_OP_START;
            }

            if(txType == DRV_ETHPHY_SMI_XFER_TYPE_READ)
            {   // start read
                miimOpHandle = hClientObj->pMiimBase->DRV_MIIM_Read(hClientObj->miimHandle, hClientObj->smiRIx, hClientObj->smiPhyAddress, DRV_MIIM_OPERATION_FLAG_NONE, &miimRes);
                newTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_BUSY_COMPLETE;
            }
            else if(txType == DRV_ETHPHY_SMI_XFER_TYPE_WRITE || txType == DRV_ETHPHY_SMI_XFER_TYPE_WRITE_COMPLETE)
            {   // start write
                if(txType == DRV_ETHPHY_SMI_XFER_TYPE_WRITE)
                {
                    opFlags = DRV_MIIM_OPERATION_FLAG_DISCARD;
                    newTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_DONE;
                }
                else
                {
                    opFlags = DRV_MIIM_OPERATION_FLAG_NONE;
                    newTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_BUSY_COMPLETE;
                }

                miimOpHandle = hClientObj->pMiimBase->DRV_MIIM_Write(hClientObj->miimHandle, hClientObj->smiRIx, hClientObj->smiPhyAddress, hClientObj->smiData, opFlags, &miimRes);
            }
            else
            {   // no scan operations allowed that take complete control of DRV_MIIM!
                _PhyAssertCond(true, __func__, __LINE__);
                miimOpHandle = 0;
            }

            if(miimOpHandle == 0)
            {   // operation failed
                _PhyDebugCond(true, __func__, __LINE__);
                newTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_DONE;
            }
            else if(newTxferStatus != DRV_ETHPHY_SMI_TXFER_OP_DONE) 
            {
                hClientObj->miimOpHandle = miimOpHandle;
            }

            return (hClientObj->smiTxferStatus = newTxferStatus);


        case DRV_ETHPHY_SMI_TXFER_OP_BUSY_COMPLETE:
            miimRes = DRV_MIIM_OperationResult(hClientObj->miimHandle, hClientObj->miimOpHandle, &opData);
            if(miimRes == DRV_MIIM_RES_PENDING)
            {   // wait op to complete
                return DRV_ETHPHY_SMI_TXFER_OP_BUSY_COMPLETE;
            }

            if(miimRes < 0)
            {   // some error has occurred
                _PhyDebugCond(true, __func__, __LINE__);
            }
            else if(txType == DRV_ETHPHY_SMI_XFER_TYPE_READ)
            {
                hClientObj->smiData = opData; // set the read result
            }

            hClientObj->miimOpHandle = 0;  // operation done
            return (hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_DONE);

        default :   // DRV_ETHPHY_SMI_TXFER_OP_NONE, DRV_ETHPHY_SMI_TXFER_OP_DONE
            return hClientObj->smiTxferStatus;
    }
}
#else
static DRV_ETHPHY_SMI_TXFER_OP_STATUS _DRV_PHY_SMITransferDo(DRV_ETHPHY_CLIENT_OBJ * hClientObj)
{
    uintptr_t ethphyId = hClientObj->ethphyId;

