aws/amazon-freertos/projects/microchip/same70_xult/mplab/aws_demos/firmware/src/config/same70_xult_nvm/driver/ethphy/src/dynamic/drv_ethphy.c
    switch(hClientObj->smiTxferStatus)
    {
        case DRV_ETHPHY_SMI_TXFER_OP_START:

            if( PLIB_ETH_MIIMIsBusy(ethphyId) )
            {   // some previous operation; wait
                return DRV_ETHPHY_SMI_TXFER_OP_START;
            }
            if(hClientObj->hDriver->busInUse != 0)
            {   // if this operation is not queued, need to wait the end of the previous one
                return DRV_ETHPHY_SMI_TXFER_OP_START;
            }

            hClientObj->hDriver->busInUse = 1;  // mark as busy
            PLIB_ETH_PHYAddressSet(ethphyId, hClientObj->smiPhyAddress);
            PLIB_ETH_RegisterAddressSet(ethphyId,hClientObj->smiRIx);

            if(hClientObj->smiTxferType == DRV_ETHPHY_SMI_XFER_TYPE_WRITE)
            {
                PLIB_ETH_MIIMWriteDataSet(ethphyId, hClientObj->smiData);
                // no need to wait for write completion
                hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_DONE;
                hClientObj->hDriver->busInUse = 0;  // clear
            }
            else if(hClientObj->smiTxferType == DRV_ETHPHY_SMI_XFER_TYPE_WRITE_COMPLETE)
            {
                PLIB_ETH_MIIMWriteDataSet(ethphyId, hClientObj->smiData);
                // wait for write completion
                hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_BUSY_COMPLETE;
            }
            else if(hClientObj->smiTxferType == DRV_ETHPHY_SMI_XFER_TYPE_READ)
            {   // start read
                PLIB_ETH_MIIMReadStart(ethphyId);
                hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_BUSY_COMPLETE;
            }
            else if(hClientObj->smiTxferType == DRV_ETHPHY_SMI_XFER_TYPE_SCAN)
            {   // SCAN
                PLIB_ETH_MIIMScanModeEnable(ethphyId);
                hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_DONE;
            }

            return hClientObj->smiTxferStatus;

        case DRV_ETHPHY_SMI_TXFER_OP_BUSY_COMPLETE:
            if ( PLIB_ETH_MIIMIsBusy(ethphyId) )
            {   // wait op to complete
                return DRV_ETHPHY_SMI_TXFER_OP_BUSY_COMPLETE;
            }

            if(hClientObj->smiTxferType == DRV_ETHPHY_SMI_XFER_TYPE_READ)
            {
                PLIB_ETH_MIIMWriteStart(ethphyId);         // Stop read cycle.
                hClientObj->smiData = PLIB_ETH_MIIMReadDataGet(ethphyId); // get the read register
            }

            hClientObj->hDriver->busInUse = 0;  // clear
            return (hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_DONE);

        default :   // DRV_ETHPHY_SMI_TXFER_OP_NONE, DRV_ETHPHY_SMI_TXFER_OP_DONE
            return hClientObj->smiTxferStatus;
    }
}
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)

static DRV_ETHPHY_SMI_TXFER_OP_STATUS _DRV_PHY_SMIReadStart(DRV_ETHPHY_CLIENT_OBJ * hClientObj, uint16_t rIx)
{
    hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_START;
    hClientObj->smiRIx = rIx;
    hClientObj->smiTxferType = DRV_ETHPHY_SMI_XFER_TYPE_READ;
    hClientObj->smiPhyAddress = hClientObj->hDriver->phyAddress;

    return _DRV_PHY_SMITransferDo(hClientObj);
}

static DRV_ETHPHY_SMI_TXFER_OP_STATUS _DRV_PHY_SMIReadStartEx(DRV_ETHPHY_CLIENT_OBJ * hClientObj, uint16_t rIx, int phyAdd)
{
    hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_START;
    hClientObj->smiRIx = rIx;
    hClientObj->smiTxferType = DRV_ETHPHY_SMI_XFER_TYPE_READ;
    hClientObj->smiPhyAddress = phyAdd;

    return _DRV_PHY_SMITransferDo(hClientObj);
}

#if !(DRV_ETHPHY_USE_DRV_MIIM)
static DRV_ETHPHY_SMI_TXFER_OP_STATUS _DRV_PHY_SMIScanStart(DRV_ETHPHY_CLIENT_OBJ * hClientObj, uint16_t rIx)
{
    hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_START;
    hClientObj->smiRIx = rIx;
    hClientObj->smiTxferType = DRV_ETHPHY_SMI_XFER_TYPE_SCAN;
    hClientObj->smiPhyAddress = hClientObj->hDriver->phyAddress;

    return _DRV_PHY_SMITransferDo(hClientObj);
}
#endif  // !(DRV_ETHPHY_USE_DRV_MIIM)

static DRV_ETHPHY_SMI_TXFER_OP_STATUS _DRV_PHY_SMIWriteStart(DRV_ETHPHY_CLIENT_OBJ * hClientObj, uint16_t rIx, uint16_t wData)
{
    hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_START;
    hClientObj->smiRIx = rIx;
    hClientObj->smiTxferType = DRV_ETHPHY_SMI_XFER_TYPE_WRITE;
    hClientObj->smiData =  wData;
    hClientObj->smiPhyAddress = hClientObj->hDriver->phyAddress;

   return  _DRV_PHY_SMITransferDo(hClientObj);
}

static DRV_ETHPHY_SMI_TXFER_OP_STATUS _DRV_PHY_SMIWriteStartEx(DRV_ETHPHY_CLIENT_OBJ * hClientObj, uint16_t rIx, uint16_t wData, int phyAdd)
{
    hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_START;
    hClientObj->smiRIx = rIx;
    hClientObj->smiTxferType = DRV_ETHPHY_SMI_XFER_TYPE_WRITE;
    hClientObj->smiData =  wData;
    hClientObj->smiPhyAddress = phyAdd;

   return  _DRV_PHY_SMITransferDo(hClientObj);
}

#if !(DRV_ETHPHY_USE_DRV_MIIM)
static DRV_ETHPHY_SMI_TXFER_OP_STATUS _DRV_PHY_SMIWriteCompleteStartEx(DRV_ETHPHY_CLIENT_OBJ * hClientObj, uint16_t rIx, uint16_t wData, int phyAdd)
{
    hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_START;
    hClientObj->smiRIx = rIx;
    hClientObj->smiTxferType = DRV_ETHPHY_SMI_XFER_TYPE_WRITE_COMPLETE;
    hClientObj->smiData =  wData;
    hClientObj->smiPhyAddress = phyAdd;

   return  _DRV_PHY_SMITransferDo(hClientObj);

}
#endif  // !(DRV_ETHPHY_USE_DRV_MIIM)

static void _DRV_PHY_SetOperPhase(DRV_ETHPHY_CLIENT_OBJ * hClientObj, uint16_t operPhase, uint16_t operSubPhase)
{
    hClientObj->operPhase = operPhase;
    hClientObj->operSubPhase = operSubPhase;
}

static void _DRV_PHY_SetOperDoneResult(DRV_ETHPHY_CLIENT_OBJ * hClientObj, DRV_ETHPHY_RESULT res)
{
    hClientObj->operPhase =  hClientObj->operSubPhase = 0;
    hClientObj->operType = DRV_ETHPHY_CLIENT_OP_TYPE_NONE;
    hClientObj->status = DRV_ETHPHY_CLIENT_STATUS_READY;
    hClientObj->operRes = res;
    if(res < 0)
    {
        SYS_CONSOLE_PRINT("DRV_PHY operation error: %d\r\n", res);
    }
}

static void _DRV_PHY_SetOperStart(DRV_ETHPHY_CLIENT_OBJ * hClientObj, DRV_ETHPHY_CLIENT_OP_TYPE opType, DRV_ETHPHY_RESULT res)
{
    hClientObj->operType = opType;
    hClientObj->operPhase = hClientObj->operSubPhase = 0; 
    hClientObj->status = DRV_ETHPHY_CLIENT_STATUS_BUSY; 
    hClientObj->operRes = res;
}


// *****************************************************************************
/* Driver Hardware instance objects.

  Summary:
    Defines the hardware instances objects that are available on the part

  Description:
    This data type defines the hardware instance objects that are available on
    the part, so as to capture the hardware state of the instance.

