aws/amazon-freertos/projects/microchip/same70_xult/mplab/aws_demos/firmware/src/config/same70_xult_nvm/driver/ethphy/src/dynamic/drv_ethphy.c
  Remarks:
    Not all modes are available on all micro-controllers.
*/

#if DRV_ETHPHY_INSTANCES_NUMBER < DRV_ETHPHY_INDEX_COUNT 
#define _DRV_ETHPHY_INSTANCES_NUMBER    DRV_ETHPHY_INSTANCES_NUMBER
#else
#define _DRV_ETHPHY_INSTANCES_NUMBER    DRV_ETHPHY_INDEX_COUNT
#endif
static DRV_ETHPHY_OBJ              gDrvETHPHYObj[_DRV_ETHPHY_INSTANCES_NUMBER];


// *****************************************************************************
// *****************************************************************************
// Section: File Scope Functions
// *****************************************************************************
// *****************************************************************************

static DRV_ETHPHY_CLIENT_OBJ * _DRV_ETHPHY_ClientObjectAllocate( DRV_ETHPHY_OBJ* hPhyObj, int* pCliIx )
{
    int ix;

    DRV_ETHPHY_CLIENT_OBJ* pClientObj = hPhyObj->objClients;
    for(ix = 0; ix < sizeof(hPhyObj->objClients) / sizeof(*hPhyObj->objClients); ix++, pClientObj++)
    {
        if(pClientObj->clientInUse == 0)
        {   // available client
            *pCliIx = ix;
            return pClientObj;
        }
    }

    return 0;
}



// *****************************************************************************
// *****************************************************************************
// Section: Driver Interface Function Definitions
// *****************************************************************************
// *****************************************************************************

// The default basic PHY driver object
//
const DRV_ETHPHY_OBJECT_BASE  DRV_ETHPHY_OBJECT_BASE_Default = 
{
    DRV_ETHPHY_Initialize,
    DRV_ETHPHY_Reinitialize,
    DRV_ETHPHY_Deinitialize,
    DRV_ETHPHY_Status,
    DRV_ETHPHY_Tasks,
    DRV_ETHPHY_Open,
    DRV_ETHPHY_Close,
    DRV_ETHPHY_ClientStatus,
    DRV_ETHPHY_ClientOperationResult,
    DRV_ETHPHY_ClientOperationAbort,
    DRV_ETHPHY_SMIRead,
    DRV_ETHPHY_SMIWrite,
    DRV_ETHPHY_SMIScanStart,
    DRV_ETHPHY_SMIScanStop,
    DRV_ETHPHY_SMIScanStatusGet,
    DRV_ETHPHY_SMIScanDataGet,
    DRV_ETHPHY_SMIStatus,
    DRV_ETHPHY_SMIClockSet,
    DRV_ETHPHY_PhyAddressGet,
    DRV_ETHPHY_Setup,
    DRV_ETHPHY_RestartNegotiation,
    DRV_ETHPHY_HWConfigFlagsGet,
    DRV_ETHPHY_NegotiationIsComplete,
    DRV_ETHPHY_NegotiationResultGet,
    DRV_ETHPHY_LinkStatusGet,
    DRV_ETHPHY_Reset,
    DRV_ETHPHY_VendorDataGet,
    DRV_ETHPHY_VendorDataSet,
    DRV_ETHPHY_VendorSMIReadStart,
    DRV_ETHPHY_VendorSMIReadResultGet,
    DRV_ETHPHY_VendorSMIWriteStart,
};



// self reference to the base object itself
static const DRV_ETHPHY_OBJECT_BASE* gDrvEthBaseObj = &DRV_ETHPHY_OBJECT_BASE_Default;


//******************************************************************************
/* Function:
    SYS_MODULE_OBJ DRV_ETHPHY_Initialize( const SYS_MODULE_INDEX    drvIndex,
                                          const SYS_MODULE_INIT     * const init )

  Summary:
    Initializes hardware and data for the given instance of the ETHPHY module

  Description:
    This routine initializes hardware for the instance of the ETHPHY module,
    using the hardware initialization given data.  It also initializes all
    necessary internal data.

  Parameters:
    drvIndex        - Identifies the driver instance to be initialized
    init            - Pointer to the data structure containing all data
                      necessary to initialize the hardware. This pointer may
                      be null if no data is required and static initialization
                      values are to be used.

  Returns:
    If successful, returns a valid handle to a driver instance object.
    Otherwise, it returns SYS_MODULE_OBJ_INVALID.
*/

SYS_MODULE_OBJ DRV_ETHPHY_Initialize( const SYS_MODULE_INDEX  iModule,
                                      const SYS_MODULE_INIT   * const init )
{
    DRV_ETHPHY_OBJ * hSysObj;
    DRV_ETHPHY_INIT *ethphyInit = NULL;

    if ( iModule >= _DRV_ETHPHY_INSTANCES_NUMBER || gDrvETHPHYObj[iModule].objInUse == true )
    {
        return SYS_MODULE_OBJ_INVALID;
    }

    hSysObj = gDrvETHPHYObj + iModule;

    /* Assign to the local pointer the init data passed */
    ethphyInit = ( DRV_ETHPHY_INIT * ) init;

#if (DRV_ETHPHY_USE_DRV_MIIM)
    if((hSysObj->pMiimBase = ethphyInit->pMiimObject) == 0)
    {
        return SYS_MODULE_OBJ_INVALID;
    }
    hSysObj->miimIndex = ethphyInit->miimIndex;
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)

    hSysObj->objInUse = true;      // Set object to be in use
    hSysObj->busInUse = 0;
    hSysObj->numClients = 0;
    hSysObj->status = SYS_STATUS_READY; // Set module state
    hSysObj->iModule  = iModule;  // Store driver instance
    hSysObj->ethphyId = ethphyInit->ethphyId; // Store PLIB ID

    // Assign External PHY Service Functions
    hSysObj->pPhyObj = ethphyInit->pPhyObject;

    memset(hSysObj->objClients, 0, sizeof(hSysObj->objClients));

    // hush compiler warning
    _PhyAssertCond(true, __func__, __LINE__);
    _PhyDebugCond(true, __func__, __LINE__);

    /* Return the driver handle */
    return ( SYS_MODULE_OBJ )hSysObj ;

}


void DRV_ETHPHY_Reinitialize( SYS_MODULE_OBJ        object ,
                              const SYS_MODULE_INIT * const init )
{
    DRV_ETHPHY_OBJ * hSysObj = (DRV_ETHPHY_OBJ *) object ;
    DRV_ETHPHY_INIT * ethphyInit = (DRV_ETHPHY_INIT *)init;

    /* Check for the valid driver object passed */
    if( NULL != hSysObj)
    {

        hSysObj->numClients = 0;
        hSysObj->status = SYS_STATUS_READY; // Set module state
        hSysObj->ethphyId = ethphyInit->ethphyId; // Store PLIB ID

        // Assign External PHY Service Functions
        hSysObj->pPhyObj = ethphyInit->pPhyObject;

        memset(hSysObj->objClients, 0, sizeof(hSysObj->objClients));
    }
}



void DRV_ETHPHY_Deinitialize( SYS_MODULE_OBJ hSysObj )
{
    DRV_ETHPHY_OBJ * hObj = (DRV_ETHPHY_OBJ *) hSysObj ;

    /* Check for the valid driver object passed */
    if( NULL != hObj)
    {

        /* Set the Device Status */
        hObj->status  = SYS_STATUS_UNINITIALIZED;

