aws/amazon-freertos/projects/microchip/same70_xult/mplab/aws_demos/firmware/src/config/same70_xult_nvm/driver/ethphy/src/dynamic/drv_ethphy.c
        /* Remove the driver usage */
        hObj->objInUse  = false;

        hObj->pPhyObj = 0;
    }

} 


SYS_STATUS DRV_ETHPHY_Status( SYS_MODULE_OBJ hSysObj )
{
    DRV_ETHPHY_OBJ * hObj = (DRV_ETHPHY_OBJ *) hSysObj ;

    /* Check for the valid driver object passed */
    if( NULL != hObj)
    {
        /* Return the status associated with the driver handle */
        return( hObj->status ) ;
    }

    return SYS_STATUS_ERROR;
} 


void DRV_ETHPHY_Tasks( SYS_MODULE_OBJ hSysObj )
{
    DRV_ETHPHY_OBJ * hObj = (DRV_ETHPHY_OBJ *) hSysObj ;

    /* Check for the valid driver object passed */
    if( NULL !=  hObj)
    {
        int ix;
        DRV_ETHPHY_CLIENT_OBJ* hClientObj = hObj->objClients;

        for(ix = 0; ix < sizeof(hObj->objClients) / sizeof(*hObj->objClients); ix++, hClientObj++)
        {
            if(hClientObj->clientInUse != 0)
            {   // active client
                (*_DRV_PHY_ClientOpTbl[hClientObj->operType])(hClientObj);
            }
        }
    }
} 


// *****************************************************************************
// *****************************************************************************
// Section: Interface Routines - Client Level
// *****************************************************************************
// *****************************************************************************


DRV_HANDLE  DRV_ETHPHY_Open ( const SYS_MODULE_INDEX iModule,
                              const DRV_IO_INTENT ioIntent )
{
    /* Multi client variables are removed from single client builds. */
    DRV_ETHPHY_OBJ * hPhyObj;
    DRV_ETHPHY_CLIENT_OBJ * hClientObj;
    int  clientIx;

    /* Validate the driver index */
    /* If there is anything specific to the module & needs to be checked, should
       be handled in this section with an || condition.
       May be something like ioIntent test for Exclusive access */
    if ( iModule >= _DRV_ETHPHY_INSTANCES_NUMBER || gDrvETHPHYObj[iModule].objInUse == false )
    {
        return DRV_HANDLE_INVALID;
    }

    /* Setup client operations */

    hPhyObj = gDrvETHPHYObj + iModule;
    /* Allocate the client object and set the flag as in use */
    hClientObj = _DRV_ETHPHY_ClientObjectAllocate(hPhyObj, &clientIx) ;
    while(hClientObj)
    {
#if (DRV_ETHPHY_USE_DRV_MIIM)
        DRV_HANDLE miimHandle = hPhyObj->pMiimBase->DRV_MIIM_Open(hPhyObj->miimIndex, DRV_IO_INTENT_SHARED);
        if(miimHandle == DRV_HANDLE_INVALID)
        {
            _PhyDebugCond(true, __func__, __LINE__);
            break;
        }
        hClientObj->pMiimBase = hPhyObj->pMiimBase;
        hClientObj->miimHandle = miimHandle;
        hClientObj->miimOpHandle = 0;
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)

        hClientObj->clientInUse    = true;
        hClientObj->clientIx = clientIx;
        hClientObj->hDriver  = hPhyObj;
        hClientObj->ethphyId = hPhyObj->ethphyId;
        hClientObj->operType = DRV_ETHPHY_CLIENT_OP_TYPE_NONE;
        hClientObj->smiTxferStatus = DRV_ETHPHY_SMI_TXFER_OP_NONE;
        _DRV_PHY_SetOperPhase(hClientObj, 0, 0);
        hPhyObj->numClients++;

        /* Update the Client Status */
        hClientObj->status = DRV_ETHPHY_CLIENT_STATUS_READY;

        /* Return the client object */
        return ( ( DRV_HANDLE ) hClientObj );
    }

    return DRV_HANDLE_INVALID;

}


//******************************************************************************
/* Function:
    void DRV_ETHPHY_Close( DRV_HANDLE handle )

  Summary:
    Closes an opened-instance of a driver

  Description:
    This routine closes an opened-instance of a driver, invalidating the given
    handle.

  Parameters:
    handle       - A valid open-instance handle, returned from the driver's
                   open routine

  Returns:
    None
*/

void DRV_ETHPHY_Close( DRV_HANDLE handle )
{
    DRV_ETHPHY_CLIENT_OBJ * hClientObj = (DRV_ETHPHY_CLIENT_OBJ *)handle;

    if(hClientObj != 0)
    {
#if (DRV_ETHPHY_USE_DRV_MIIM)
        hClientObj->pMiimBase->DRV_MIIM_Close(hClientObj->miimHandle);
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)

        /* Free the Client Instance */
        hClientObj->clientInUse = false ;
        hClientObj->hDriver->numClients--;

        /* Update the Client Status */
        hClientObj->status = DRV_ETHPHY_CLIENT_STATUS_CLOSED;
    }

}

DRV_ETHPHY_RESULT DRV_ETHPHY_Setup( DRV_HANDLE handle, DRV_ETHPHY_SETUP* pSetUp, TCPIP_ETH_OPEN_FLAGS* pSetupFlags)
{

    DRV_ETHPHY_OBJ * hDriver;
    const DRV_ETHPHY_OBJECT* pPhyObj;
    DRV_ETHPHY_CLIENT_OBJ * hClientObj = (DRV_ETHPHY_CLIENT_OBJ *) handle;

    /* Check for the Client validity */
    if(hClientObj == 0)
    {
        return DRV_ETHPHY_RES_HANDLE_ERR;
    }

    if(hClientObj->status != DRV_ETHPHY_CLIENT_STATUS_READY)
    {   // another op going on
        return DRV_ETHPHY_RES_NOT_READY_ERR;
    }

    // basic sanity check
    if(pSetUp == 0 || pSetupFlags == 0)
    {
        return DRV_ETHPHY_RES_OPERATION_ERR;
    }

    // check the PHY set up parameters
    hDriver = hClientObj->hDriver;
    pPhyObj = hDriver->pPhyObj;

    if(pPhyObj == 0 || pPhyObj->miiConfigure == 0 || pPhyObj->mdixConfigure == 0 || pPhyObj->smiClockGet == 0)
    {
        return DRV_ETHPHY_RES_OPERATION_ERR;
    }

    if(pSetUp->resetFunction)
    {
        (*pSetUp->resetFunction)(gDrvEthBaseObj);
    }
#if (DRV_ETHPHY_USE_DRV_MIIM)
    DRV_MIIM_SETUP  miimSetup;

	miimSetup.hostClockFreq = (uint32_t)TCPIP_INTMAC_PERIPHERAL_CLK;


    miimSetup.maxBusFreq = (*pPhyObj->smiClockGet)(gDrvEthBaseObj, handle);
    miimSetup.setupFlags = DRV_MIIM_SETUP_FLAG_NONE;

    DRV_MIIM_RESULT miimRes = hClientObj->pMiimBase->DRV_MIIM_Setup(hClientObj->miimHandle, &miimSetup); 
    if(miimRes < 0)
    {   // error occurred
        _PhyDebugCond(true, __func__, __LINE__);
        return DRV_ETHPHY_RES_MIIM_ERR;
    }
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)

    hDriver->phyAddress = pSetUp->phyAddress;
    hDriver->openFlags = pSetUp->openFlags;
    hDriver->configFlags = pSetUp->configFlags;
    hDriver->macPauseType = pSetUp->macPauseType;
    
    hClientObj->operParam = (uintptr_t)pSetupFlags;
    _DRV_PHY_SetOperStart(hClientObj, DRV_ETHPHY_CLIENT_OP_TYPE_SETUP, DRV_ETHPHY_RES_PENDING);

    return DRV_ETHPHY_RES_PENDING;
}

static void _DRV_ETHPHY_ClientOpNone(DRV_ETHPHY_CLIENT_OBJ * hClientObj)
{
}

static void _DRV_ETHPHY_ClientOpSetup(DRV_ETHPHY_CLIENT_OBJ * hClientObj)
{
    if((unsigned int)hClientObj->operPhase >= sizeof(_DRV_PHY_SetupPhasesTbl)/sizeof(*_DRV_PHY_SetupPhasesTbl))
    {   // shouldn't happen
        _DRV_PHY_SetOperDoneResult(hClientObj, DRV_ETHPHY_RES_OPERATION_ERR);
    }
    else
    {
        (*_DRV_PHY_SetupPhasesTbl[hClientObj->operPhase])(hClientObj);
    }
}


static void _DRV_ETHPHY_SetupPhaseIdle(DRV_ETHPHY_CLIENT_OBJ * hClientObj)
{

    DRV_ETHPHY_OBJ * hDriver = NULL;
    DRV_ETHPHY_CONFIG_FLAGS configFlags = DRV_ETHPHY_CFG_DEFAULT;
    TCPIP_ETH_OPEN_FLAGS      openFlags = TCPIP_ETH_OPEN_DEFAULT;      // flags required at open time

    hDriver = hClientObj->hDriver;

