aws/amazon-freertos/projects/microchip/same70_xult/mplab/aws_demos/firmware/src/config/same70_xult_nvm/driver/ethphy/src/dynamic/drv_ethphy.c
    configFlags = hDriver->configFlags;

#if defined(__PIC32MX__) || defined(__PIC32MZ__)
    // get the way the hw is configured
    DRV_ETHPHY_CONFIG_FLAGS hwFlags = DRV_ETHPHY_CFG_DEFAULT;
    DRV_ETHPHY_HWConfigFlagsGet((DRV_HANDLE)hClientObj, &hwFlags);

    if(configFlags & DRV_ETHPHY_CFG_AUTO)
    {
        hDriver->configFlags = configFlags = hwFlags;
    }
    else
    {   // some minimal check against the way the hw is configured
        DRV_ETHPHY_CONFIG_FLAGS swFlags = configFlags & (DRV_ETHPHY_CFG_RMII|DRV_ETHPHY_CFG_ALTERNATE);

        if((swFlags ^ hwFlags) != 0)
        {   // hw-sw configuration mismatch MII/RMII, ALT/DEF config
            _DRV_PHY_SetOperDoneResult(hClientObj, DRV_ETHPHY_RES_CFG_ERR);
        }
    }
#endif

    openFlags = hDriver->openFlags;
    if(openFlags & (TCPIP_ETH_OPEN_PHY_LOOPBACK | TCPIP_ETH_OPEN_MAC_LOOPBACK))
    {
        openFlags &= ~TCPIP_ETH_OPEN_AUTO; // no negotiation in loopback mode!
    }

    if(!(openFlags & TCPIP_ETH_OPEN_AUTO))
    {
        openFlags &= ~TCPIP_ETH_OPEN_MDIX_AUTO;        // Auto-MDIX has to be in auto negotiation only
    }

    openFlags |= (configFlags & DRV_ETHPHY_CFG_RMII) ? TCPIP_ETH_OPEN_RMII : TCPIP_ETH_OPEN_MII;

    hDriver->openFlags = openFlags;


#if !(DRV_ETHPHY_USE_DRV_MIIM)
    // Set SMI clock
    DRV_ETHPHY_VENDOR_SMI_CLOCK_GET phySMIClockGet = hDriver->pPhyObj->smiClockGet;

#if defined (__PIC32MZ__)
    DRV_ETHPHY_SMIClockSet((DRV_HANDLE)hClientObj, SYS_CLK_PeripheralFrequencyGet(CLK_BUS_PERIPHERAL_5), (*phySMIClockGet)(gDrvEthBaseObj, (DRV_HANDLE)hClientObj) );
#elif defined (__PIC32C__) || defined(__SAMA5D2__)
    DRV_ETHPHY_SMIClockSet((DRV_HANDLE)hClientObj, SYS_CLK_FrequencyGet(SYS_CLK_MASTER), (*phySMIClockGet)(gDrvEthBaseObj, (DRV_HANDLE)hClientObj) );
#else
    DRV_ETHPHY_SMIClockSet((DRV_HANDLE)hClientObj, SYS_CLK_SystemFrequencyGet(), (*phySMIClockGet)(gDrvEthBaseObj, (DRV_HANDLE)hClientObj) );
#endif
#endif  // !(DRV_ETHPHY_USE_DRV_MIIM)

    hClientObj->operTStamp = SYS_TMR_TickCountGet() + ((DRV_ETHPHY_RESET_CLR_TMO * SYS_TMR_TickCounterFrequencyGet()) + 999) / 1000;
    _DRV_PHY_SetOperPhase(hClientObj, DRV_ETHPHY_SETUP_PHASE_DETECT, 0);
}

    
static void _DRV_ETHPHY_SetupPhaseDetect(DRV_ETHPHY_CLIENT_OBJ * hClientObj)
{
    // try to detect the PHY and reset it
    __BMCONbits_t bmcon;

    // all phases except 0 wait for the completion of an SMI transaction

    if(hClientObj->operSubPhase == 0)
    {   // initiate a read of the BMCON register
        _DRV_PHY_SMIReadStart(hClientObj, PHY_REG_BMCON);
        _DRV_PHY_SetOperPhase(hClientObj, DRV_ETHPHY_SETUP_PHASE_DETECT, 1);
    }

    // wait the BMCON read/write to complete
    if(_DRV_PHY_SMITransferDo(hClientObj) != DRV_ETHPHY_SMI_TXFER_OP_DONE)
    {
        return;
    }

    switch (hClientObj->operSubPhase)
    {
        case 1:
            bmcon.w = hClientObj->smiData;
            if(bmcon.RESET)
            {   // that is suspicios...but give it a chance to clear itself
                if(SYS_TMR_TickCountGet() < hClientObj->operTStamp)
                {   // not yet tmo
                    _DRV_PHY_SetOperPhase(hClientObj, DRV_ETHPHY_SETUP_PHASE_DETECT, 0);
                }
                else
                {
                    _DRV_PHY_SetOperDoneResult(hClientObj, DRV_ETHPHY_RES_DTCT_ERR);
                }
                break;
            }

            // success
            // ok, reset bit is low
            // try to see if we can write smth to the PHY
            // we use BMCON::Loopback and duplex bits
            _DRV_PHY_SMIWriteStart(hClientObj, PHY_REG_BMCON, _BMCON_LOOPBACK_MASK|_BMCON_DUPLEX_MASK);
            _DRV_PHY_SetOperPhase(hClientObj, DRV_ETHPHY_SETUP_PHASE_DETECT, 2);
            break;

        case 2:
            // re-read the BMCON
            _DRV_PHY_SMIReadStart(hClientObj, PHY_REG_BMCON);
            _DRV_PHY_SetOperPhase(hClientObj, DRV_ETHPHY_SETUP_PHASE_DETECT, 3);
            break;

        case 3:
            bmcon.w = hClientObj->smiData;
            if( (bmcon.LOOPBACK == 0) || (bmcon.DUPLEX == 0) )
            {   // failed to set
                 _DRV_PHY_SetOperDoneResult(hClientObj, DRV_ETHPHY_RES_DTCT_ERR);
            }
            else
            {   // clear bits and write
                _DRV_PHY_SMIWriteStart(hClientObj, PHY_REG_BMCON, bmcon.w ^ (_BMCON_LOOPBACK_MASK|_BMCON_DUPLEX_MASK));
                _DRV_PHY_SetOperPhase(hClientObj, DRV_ETHPHY_SETUP_PHASE_DETECT, 4);
            }
            break;

        case 4:
            _DRV_PHY_SMIReadStart(hClientObj, PHY_REG_BMCON);
            _DRV_PHY_SetOperPhase(hClientObj, DRV_ETHPHY_SETUP_PHASE_DETECT, 5);
            break;

        case 5:
            bmcon.w = hClientObj->smiData;
            if(bmcon.LOOPBACK || bmcon.DUPLEX)
            {   // failed to clear
                _DRV_PHY_SetOperDoneResult(hClientObj, DRV_ETHPHY_RES_DTCT_ERR);
            }
            else
            {   // everything seems to be fine
                // initiate the PHY reset
                _DRV_PHY_SetOperPhase(hClientObj, DRV_ETHPHY_SETUP_PHASE_RESET, 0);
            }

            break;

        default:
            // shouldn't happen
            _DRV_PHY_SetOperDoneResult(hClientObj, DRV_ETHPHY_RES_OPERATION_ERR);
    }
}

// performs the PHY reset
static void _DRV_ETHPHY_SetupPhaseReset(DRV_ETHPHY_CLIENT_OBJ * hClientObj)
{
    __BMCONbits_t bmcon;

    if(hClientObj->operSubPhase == 0)
    {   // initiate Soft Reset the PHY
        _DRV_PHY_SMIWriteStart(hClientObj, PHY_REG_BMCON, _BMCON_RESET_MASK);
        _DRV_PHY_SetOperPhase(hClientObj, DRV_ETHPHY_SETUP_PHASE_RESET, 1);
        return;
    }

    // all other phases wait for some transaction to finish
    // wait the BMCON write/read to complete
    if(_DRV_PHY_SMITransferDo(hClientObj) != DRV_ETHPHY_SMI_TXFER_OP_DONE)
    {
        return;
    }

    switch(hClientObj->operSubPhase)
    {
        case 1:
            // read the BMCON
            _DRV_PHY_SMIReadStart(hClientObj, PHY_REG_BMCON);
            hClientObj->operTStamp = SYS_TMR_TickCountGet() + ((DRV_ETHPHY_RESET_CLR_TMO * SYS_TMR_TickCounterFrequencyGet()) + 999) / 1000;
            _DRV_PHY_SetOperPhase(hClientObj, DRV_ETHPHY_SETUP_PHASE_RESET, 2);
            break;

