aws/amazon-freertos/projects/microchip/same70_xult/mplab/aws_demos/firmware/src/config/same70_xult_nvm/driver/ethphy/src/dynamic/drv_ethphy.c
    hClientObj->operParam = waitComplete;


    _DRV_PHY_SetOperStart(hClientObj, DRV_ETHPHY_CLIENT_OP_SMI_WRITE, DRV_ETHPHY_RES_PENDING);
    if(waitComplete)
    {
        _DRV_PHY_SMIWriteCompleteStartEx(hClientObj, rIx, wData, phyAdd);
    }
    else
    {
        _DRV_PHY_SMIWriteStartEx(hClientObj, rIx, wData, phyAdd);
    }

    return DRV_ETHPHY_RES_PENDING;
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)
}


static void _DRV_ETHPHY_ClientOpSmiWrite(DRV_ETHPHY_CLIENT_OBJ * hClientObj)
{
    // wait for write transfer to complete
    if(_DRV_PHY_SMITransferDo(hClientObj) != DRV_ETHPHY_SMI_TXFER_OP_DONE)
    {
        return;
    }

    // done
    _DRV_PHY_SetOperDoneResult(hClientObj, DRV_ETHPHY_RES_OK);
}


DRV_ETHPHY_RESULT DRV_ETHPHY_SMIScanStart( DRV_HANDLE handle, unsigned int rIx)
{
#if (DRV_ETHPHY_USE_DRV_MIIM)
    return DRV_ETHPHY_RES_OPERATION_ERR; 
#else
    DRV_ETHPHY_CLIENT_OBJ * hClientObj = (DRV_ETHPHY_CLIENT_OBJ *) handle;

    if( hClientObj == 0)
    {
        return DRV_ETHPHY_RES_HANDLE_ERR;
    }

    if(hClientObj->status != DRV_ETHPHY_CLIENT_STATUS_READY)
    {   // another op going on
        return DRV_ETHPHY_RES_NOT_READY_ERR;
    }

    _DRV_PHY_SetOperStart(hClientObj, DRV_ETHPHY_CLIENT_OP_SMI_SCAN, DRV_ETHPHY_RES_PENDING);
    _DRV_PHY_SMIScanStart(hClientObj, rIx);


    return DRV_ETHPHY_RES_PENDING;
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)
}

static void _DRV_ETHPHY_ClientOpSmiScan(DRV_ETHPHY_CLIENT_OBJ * hClientObj)
{
    // wait for scan transfer to complete
    if(_DRV_PHY_SMITransferDo(hClientObj) != DRV_ETHPHY_SMI_TXFER_OP_DONE)
    {
        return;
    }

    // done; remain busy as to not start another SMI operation before aborting this one

}


DRV_ETHPHY_RESULT DRV_ETHPHY_SMIScanStop( DRV_HANDLE handle )
{
#if (DRV_ETHPHY_USE_DRV_MIIM)
    return DRV_ETHPHY_RES_OPERATION_ERR; 
#else
    DRV_ETHPHY_CLIENT_OBJ * hClientObj = (DRV_ETHPHY_CLIENT_OBJ *) handle;

    if( hClientObj == 0)
    {
        return DRV_ETHPHY_RES_HANDLE_ERR;
    }

    if(hClientObj->status != DRV_ETHPHY_CLIENT_STATUS_BUSY || hClientObj->operType != DRV_ETHPHY_CLIENT_OP_SMI_SCAN)
    {   // not scanning?
        return DRV_ETHPHY_RES_OPERATION_ERR;
    }

    PLIB_ETH_MIIMScanModeDisable(hClientObj->ethphyId);
    _DRV_PHY_SetOperDoneResult(hClientObj, DRV_ETHPHY_RES_OK);
    hClientObj->hDriver->busInUse = 0;  // clear
    return DRV_ETHPHY_RES_OK;
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)
}


DRV_ETHPHY_RESULT DRV_ETHPHY_SMIScanStatusGet( DRV_HANDLE handle )
{
#if (DRV_ETHPHY_USE_DRV_MIIM)
    return DRV_ETHPHY_RES_OPERATION_ERR; 
#else
    DRV_ETHPHY_CLIENT_OBJ * hClientObj = (DRV_ETHPHY_CLIENT_OBJ *) handle;

    if( hClientObj == 0)
    {
        return DRV_ETHPHY_RES_HANDLE_ERR;
    }

    if(hClientObj->status != DRV_ETHPHY_CLIENT_STATUS_BUSY || hClientObj->operType != DRV_ETHPHY_CLIENT_OP_SMI_SCAN)
    {   // not scanning?
        return DRV_ETHPHY_RES_OPERATION_ERR;
    }

    return PLIB_ETH_DataNotValid(hClientObj->ethphyId) ? DRV_ETHPHY_RES_PENDING : DRV_ETHPHY_RES_OK;
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)
}

DRV_ETHPHY_RESULT DRV_ETHPHY_SMIScanDataGet( DRV_HANDLE handle, uint16_t* pScanRes )
{
#if (DRV_ETHPHY_USE_DRV_MIIM)
    return DRV_ETHPHY_RES_OPERATION_ERR; 
#else
    DRV_ETHPHY_CLIENT_OBJ * hClientObj = (DRV_ETHPHY_CLIENT_OBJ *) handle;

    if( hClientObj == 0)
    {
        return DRV_ETHPHY_RES_HANDLE_ERR;
    }

    if(hClientObj->status != DRV_ETHPHY_CLIENT_STATUS_BUSY || hClientObj->operType != DRV_ETHPHY_CLIENT_OP_SMI_SCAN)
    {   // not scanning?
        return DRV_ETHPHY_RES_OPERATION_ERR;
    }

    if( PLIB_ETH_DataNotValid(hClientObj->ethphyId) )
    {   // no data available yet
        return DRV_ETHPHY_RES_PENDING;
    }

    uint16_t scanData = PLIB_ETH_MIIMReadDataGet(hClientObj->ethphyId);
    if(pScanRes)
    {
        *pScanRes = scanData;
    }
    
    return DRV_ETHPHY_RES_OK;
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)
}

DRV_ETHPHY_RESULT DRV_ETHPHY_SMIStatus( DRV_HANDLE handle )
{
#if (DRV_ETHPHY_USE_DRV_MIIM)
    return DRV_ETHPHY_RES_OPERATION_ERR; 
#else
    DRV_ETHPHY_CLIENT_OBJ * hClientObj = (DRV_ETHPHY_CLIENT_OBJ *) handle;

    if( hClientObj == 0)
    {
        return DRV_ETHPHY_RES_HANDLE_ERR;
    }

    return PLIB_ETH_MIIMIsBusy(hClientObj->ethphyId) ? DRV_ETHPHY_RES_BUSY : DRV_ETHPHY_RES_OK;
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)
} 

DRV_ETHPHY_RESULT DRV_ETHPHY_SMIClockSet( DRV_HANDLE handle,
                             uint32_t hostClock,
                             uint32_t maxSMIClock )
{
#if (DRV_ETHPHY_USE_DRV_MIIM)
    return DRV_ETHPHY_RES_OPERATION_ERR; 
#else
    DRV_ETHPHY_CLIENT_OBJ * hClientObj = (DRV_ETHPHY_CLIENT_OBJ *) handle;
    int  ix;
    uintptr_t    ethphyId; 

    if( hClientObj == 0)
    {
        return DRV_ETHPHY_RES_HANDLE_ERR;
    }

    ethphyId = hClientObj->ethphyId;
    PLIB_ETH_MIIMResetEnable(ethphyId); // Issue MIIM reset
    PLIB_ETH_MIIMResetDisable(ethphyId); // Clear MIIM reset

    for(ix=0; ix<sizeof(_MIIClockDivisorTable)/sizeof(*_MIIClockDivisorTable); ix++)
    {
        if(hostClock/_MIIClockDivisorTable[ix]<=maxSMIClock)
        {   // found it
            break;
        }
    }

    if(ix == sizeof(_MIIClockDivisorTable)/sizeof(*_MIIClockDivisorTable))
    {
        ix--;   // max divider; best we can do
    }
    PLIB_ETH_MIIMClockSet(ethphyId,ix+1);  // program the clock

    return DRV_ETHPHY_RES_OK;
#endif  // (DRV_ETHPHY_USE_DRV_MIIM)
} 

DRV_ETHPHY_RESULT DRV_ETHPHY_PhyAddressGet( DRV_HANDLE handle, DRV_ETHPHY_INTERFACE_INDEX portIndex, int* pPhyAddress)
{
    (void)portIndex;
    DRV_ETHPHY_CLIENT_OBJ * hClientObj = (DRV_ETHPHY_CLIENT_OBJ *) handle;
    if( hClientObj == 0)
    {
        return DRV_ETHPHY_RES_HANDLE_ERR;
    }

    if(pPhyAddress)
    {
        *pPhyAddress = hClientObj->hDriver->phyAddress;
    }
    return DRV_ETHPHY_RES_OK;
}


// *****************************************************************************
// *****************************************************************************
// Section: Interface Routines - Client & Module Level
// *****************************************************************************
// *****************************************************************************

DRV_ETHPHY_RESULT DRV_ETHPHY_RestartNegotiation( DRV_HANDLE hClient, DRV_ETHPHY_INTERFACE_INDEX portIndex )
{
    (void)portIndex;
    DRV_ETHPHY_CLIENT_OBJ * hClientObj = (DRV_ETHPHY_CLIENT_OBJ *) hClient;

